app/views/laboratory/show.html.erb

        <% if timeLab < time %>
          <h1>Sem sinal do dispositivo. :(</h1>
        <% else %>
          <% if @status.isOpen %>
            <% a = @labs.subjects.where("begin <= ?", DateTime.current).where("end > ?", (DateTime.current.to_time + 1.hours).to_datetime ) %>
            <% if !a.empty?# && !a[0].isFreeToJoin%>
              <h1> Acontencendo a aula <%= a[0].title %>!</h1>
              <%= a[0].begin %><br>
              <%= a[0].end %><br>
            <% elsif Time.now.hour > 23 && Time.now.hour < 8%>
              <h1> Está aberto! Mas deveria? :s</h1>
            <% else %>
              <h1>Está aberto! :)</h1>
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."laboratory_id" = ? AND (begin >= '2016-07-31 21:28:40.418797') AND (end < '2016-07-31 21:28:40.419356')  [["laboratory_id", 1]]
SELECT COUNT(*) FROM "subjects" WHERE "subjects"."laboratory_id" = ? AND (begin >= '2016-07-31 21:36:53.639500') AND (end < '2016-07-31 21:36:53.640123')  [["laboratory_id", 1]]

            <div class="pc-wrapper">
              <div class="<%= @computers.find_by(:physical_id=> 1).computer_status.last.last_status%>">PC 1<br>Em uso</div>
---
SELECT  "computer_statuses".* FROM "computer_statuses" WHERE "computer_statuses"."computer_id" = ? ORDER BY "computer_statuses"."id" DESC LIMIT ?  [["computer_id", 53], ["LIMIT", 1]]
SELECT  "computers".* FROM "computers" WHERE "computers"."laboratory_id" = ? AND "computers"."physical_id" = ? LIMIT ?  [["laboratory_id", 48], ["physical_id", 1], ["LIMIT", 1]]
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."laboratory_id" = ? ORDER BY "statuses"."id" DESC LIMIT ?  [["laboratory_id", 1], ["LIMIT", 1]]