app/controllers/laboratory_controller.rb

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."initials" = ? LIMIT ?  [["initials", "LSO"], ["LIMIT", 1]]
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."laboratory_id" = ? ORDER BY "statuses"."id" DESC LIMIT ?  [["laboratory_id", 1], ["LIMIT", 1]]
---
  def show
    if params[:initials] != nil
      @labs = Laboratory.find_by(:initials => params[:initials])
    else
      @labs = Laboratory.find_by(:initials => "LSO")
    end
    @status = @labs.status.last