app/controllers/status_controller.rb

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."initials" = ? LIMIT ?  [["initials", "LSO"], ["LIMIT", 1]]
SELECT  "computers".* FROM "computers" WHERE "computers"."laboratory_id" = ? AND "computers"."physical_id" = ? LIMIT ?  [["laboratory_id", 45], ["physical_id", 3], ["LIMIT", 1]]
INSERT INTO "computer_statuses" ("status", "computer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["status", "available"], ["computer_id", 5], ["created_at", 2016-10-12 21:42:39 UTC], ["updated_at", 2016-10-12 21:42:39 UTC]]
UPDATE "computers" SET "status" = ?, "updated_at" = ? WHERE "computers"."id" = ?  [["status", "available"], ["updated_at", 2016-10-14 11:46:48 UTC], ["id", 134]]
---
  def new_computer
    respond_to do |format|
      @lab = Laboratory.find_by(:initials => params[:initials])

      if @lab == nil
        output = "this lab does not exist"
        format.json { render json: output.to_json }
        return
      end

      @computer = @lab.computers.find_by(:physical_id => params[:computer_id])

      if @computer == nil
        format.json { render json: {'error'=>'this computer does not exist.'}.to_json }
        return
      else
        puts "entrada1"
        @computer = @computer.computer_status.new(:status => params[:status])
      end

      if @computer.save